import { Component, OnInit } from '@angular/core';
import { IProduct } from 'src/app/shared/interfaces/product';

@Component({
  selector: 'app-cart',
  templateUrl: './cart.component.html',
  styleUrls: ['./cart.component.scss']
})
export class CartComponent implements OnInit {
  cartItems: IProduct[];
  constructor() { }

  ngOnInit(): void {
    this.cartItems = [
      {
        _id: '5fb42f522db6ab365ccd2397',
        title: 'VEGAS ROBAINA UNICOS',
        imageUrl: 'https://kalimancaribe.com/images/thumbnails/650/366/detailed/1/productimage-picture-vegas-robaina-unicos-73.png',
        price: 28.5,
        brand: 'Vegas Robaina',
        vitola: 'Piramide',
        length: 156,
        ring: 52,
        strength: 'Средна към силна',
        time: 70,
        description: 'През цялото време се отличава с добра пропускливост и светлосива пепел. В края загатва за истинския си потенциал, с чувство за неповторимост. Бонус е светлокафявото обвивно листо, подбрано специално за марката. Обвивното листо на тази разкошна пирамида е едно от най-жизнените и красиви въобще за цялата гама на Хаванските пури. Всяка веничка те приласкава и гали, а крайчецът е с гладък рисунък като дипла на роклята на холандска благородничка. Освен радост за окото, то предоставя филигранен и нежен завършек, мек и гладък като коприна. Финалът е типичен за марката, без да става натрапчив, той е завършващ с акумулиращия ефект от предишните две третини. И чувство за пълнота, разбира се. Подходяща за последна, завършваща пура.',
        __v: 0
      },
      {
        _id: '5fb42f522db6ab365ccd2397',
        title: 'VEGAS ROBAINA UNICOS',
        imageUrl: 'https://kalimancaribe.com/images/thumbnails/650/366/detailed/1/productimage-picture-vegas-robaina-unicos-73.png',
        price: 28.5,
        brand: 'Vegas Robaina',
        vitola: 'Piramide',
        length: 156,
        ring: 52,
        strength: 'Средна към силна',
        time: 70,
        description: 'През цялото време се отличава с добра пропускливост и светлосива пепел. В края загатва за истинския си потенциал, с чувство за неповторимост. Бонус е светлокафявото обвивно листо, подбрано специално за марката. Обвивното листо на тази разкошна пирамида е едно от най-жизнените и красиви въобще за цялата гама на Хаванските пури. Всяка веничка те приласкава и гали, а крайчецът е с гладък рисунък като дипла на роклята на холандска благородничка. Освен радост за окото, то предоставя филигранен и нежен завършек, мек и гладък като коприна. Финалът е типичен за марката, без да става натрапчив, той е завършващ с акумулиращия ефект от предишните две третини. И чувство за пълнота, разбира се. Подходяща за последна, завършваща пура.',
        __v: 0
      },
      {
        _id: '5fb42f522db6ab365ccd2397',
        title: 'VEGAS ROBAINA UNICOS',
        imageUrl: 'https://kalimancaribe.com/images/thumbnails/650/366/detailed/1/productimage-picture-vegas-robaina-unicos-73.png',
        price: 28.5,
        brand: 'Vegas Robaina',
        vitola: 'Piramide',
        length: 156,
        ring: 52,
        strength: 'Средна към силна',
        time: 70,
        description: 'През цялото време се отличава с добра пропускливост и светлосива пепел. В края загатва за истинския си потенциал, с чувство за неповторимост. Бонус е светлокафявото обвивно листо, подбрано специално за марката. Обвивното листо на тази разкошна пирамида е едно от най-жизнените и красиви въобще за цялата гама на Хаванските пури. Всяка веничка те приласкава и гали, а крайчецът е с гладък рисунък като дипла на роклята на холандска благородничка. Освен радост за окото, то предоставя филигранен и нежен завършек, мек и гладък като коприна. Финалът е типичен за марката, без да става натрапчив, той е завършващ с акумулиращия ефект от предишните две третини. И чувство за пълнота, разбира се. Подходяща за последна, завършваща пура.',
        __v: 0
      },
      {
        _id: '5fb42f522db6ab365ccd2397',
        title: 'VEGAS ROBAINA UNICOS',
        imageUrl: 'https://kalimancaribe.com/images/thumbnails/650/366/detailed/1/productimage-picture-vegas-robaina-unicos-73.png',
        price: 28.5,
        brand: 'Vegas Robaina',
        vitola: 'Piramide',
        length: 156,
        ring: 52,
        strength: 'Средна към силна',
        time: 70,
        description: 'През цялото време се отличава с добра пропускливост и светлосива пепел. В края загатва за истинския си потенциал, с чувство за неповторимост. Бонус е светлокафявото обвивно листо, подбрано специално за марката. Обвивното листо на тази разкошна пирамида е едно от най-жизнените и красиви въобще за цялата гама на Хаванските пури. Всяка веничка те приласкава и гали, а крайчецът е с гладък рисунък като дипла на роклята на холандска благородничка. Освен радост за окото, то предоставя филигранен и нежен завършек, мек и гладък като коприна. Финалът е типичен за марката, без да става натрапчив, той е завършващ с акумулиращия ефект от предишните две третини. И чувство за пълнота, разбира се. Подходяща за последна, завършваща пура.',
        __v: 0
      },
      {
        _id: '5fb42f522db6ab365ccd2397',
        title: 'VEGAS ROBAINA UNICOS',
        imageUrl: 'https://kalimancaribe.com/images/thumbnails/650/366/detailed/1/productimage-picture-vegas-robaina-unicos-73.png',
        price: 28.5,
        brand: 'Vegas Robaina',
        vitola: 'Piramide',
        length: 156,
        ring: 52,
        strength: 'Средна към силна',
        time: 70,
        description: 'През цялото време се отличава с добра пропускливост и светлосива пепел. В края загатва за истинския си потенциал, с чувство за неповторимост. Бонус е светлокафявото обвивно листо, подбрано специално за марката. Обвивното листо на тази разкошна пирамида е едно от най-жизнените и красиви въобще за цялата гама на Хаванските пури. Всяка веничка те приласкава и гали, а крайчецът е с гладък рисунък като дипла на роклята на холандска благородничка. Освен радост за окото, то предоставя филигранен и нежен завършек, мек и гладък като коприна. Финалът е типичен за марката, без да става натрапчив, той е завършващ с акумулиращия ефект от предишните две третини. И чувство за пълнота, разбира се. Подходяща за последна, завършваща пура.',
        __v: 0
      }
    ];
  }
}
